[
  "\n\nMukesh Narasimha <muke2110@gmail.com>\n[Important] Cognizant invites you to take the aptitude assessment\n1 message\nSuperset <notifications@joinsuperset.com>21 May 2025 at 13:53\nTo: muke2110@gmail.com\nDear Candidate,\nGreetings from Cognizant!\nWe are pleased to share that you have been shortlisted for the Cognizant hiring aptitude assessment,\nand the duration of the same is 80 minutes.\nPlease find the assessment details and essential system set-up guidelines below. Only one attempt is\navailable t",
  " guidelines below. Only one attempt is\navailable therefore ensure that your system is equipped with a working webcam & ensure that it is fully\ncharged / powered throughout the assessment duration with uninterrupted internet.\nThe assessment can ONLY be taken through a Safe Assessment Browser (SAB) and we strongly\nrecommend you to complete the system check, SAB installation and any other related configuration (if\nrequired, based on your system) well in advance before the assessment.\nLaptop/Desktop",
  "l in advance before the assessment.\nLaptop/Desktop Users**\nStepsLinks\nAon GuideClick here to download\nDownload and Install the SAB toolRefer Page 9 & 10 of the Aon Guide\n**Apple devices are not supported\nMandatory pre-requisite:\nRead the Aon guide well in advance for installation guidelines & frequently asked questions.\nInstall Safe Assessment Browser (SAB) tool for laptop / desktop - as assessment runs only on the SAB\ntool. Web browser is not allowed to take the test.\nKeep your college ID proof",
  "lowed to take the test.\nKeep your college ID proof ready - this will be captured at the beginning of the assessment. Make sure the\nID proof is valid & clearly captured.\nDo's\n✓\nIf you are taking the assessment through your desktop / laptop & suspect that internet connectivity may interrupt\nthe assessment, it is recommended that you use your mobile hotspot to provide either a primary or a backup\nconnection source.\n5/21/25, 2:41 PMGmail - [Important] Cognizant invites you to take the aptitude asses",
  "] Cognizant invites you to take the aptitude assessment\nhttps://mail.google.com/mail/u/0/?ik=51ecd87b23&view=pt&search=all&permthid=thread-f:1832717715792340933&simpl=msg-f:1832717715792...1/3\n\n✓\nInstall the latest version of the Google Chrome browser on your system.\n✓\nTake the assessment on a system equipped with a working webcam (external or built-in, with latest camera\ndrivers installed) and ensure smooth internet connectivity, throughout the assessment.\n✓\nRemain seated in front of your webca",
  "assessment.\n✓\nRemain seated in front of your webcam / mobile camera for the entire duration of the assessment.\n✓\nTake the assessment from a quiet area with adequate brightness. Adjust indoor lighting and camera angle to\nmake sure the face is clearly visible, at all times.\n✓\nEnsure to have a plain background and avoid photos, pictures, curtains, clothes, and decorations as a\nbackdrop.\n✓\nMake a note of your login credentials beforehand as switching the screen is not possible after opening the SAB\n",
  " the screen is not possible after opening the SAB\ntool.\n✓\nRead the FAQs in Aon guide book, prior to the assessment & refer to it in case of any error during the\nassessment.\n✓\nCarry ID proof (college ID card) - this will be captured in the beginning of the assessment.\nDon'ts\n✕\nLook sideways.\n✕\nLeave your seat.\n✕\nUse any other electronic device like mobile phones, headsets / earphones, ear pods, calculators or recording\ndevices.\n✕\nCover the webcam at any point and mute your audio system or unplug ",
  "at any point and mute your audio system or unplug the webcam.\n✕\nPress 'Backspace' or 'Refresh'.\n✕\nHave anyone else present in the room apart from you. If other person is detected, then you will be disqualified.\n✕\nUse AI platforms like Chat GPT for any of the hiring rounds.\nZero Tolerance for Malpractice\nThe assessment platform uses AI mechanisms to track malpractice. Any\ncandidate found to be using unfair means (like Telegram) will be\ndisqualified from the hiring process, without notice.\nCogniza",
  "d from the hiring process, without notice.\nCognizant has a zero-tolerance policy for malpractice. A disqualification\nmay be issued at any stage of the process, as and when malpractice is\ndetected and is solely at the discretion of Cognizant.\nSystem Requirements\nEnsure you have a operational webcam connected to your system.\nOS requirements: Only Windows: 11, 10, 8, 7. Mac/ Linux are not supported.\nDevice memory specifications: Windows - 2 GB RAM.\nDevice hard disk space specifications: Windows - 2",
  "Device hard disk space specifications: Windows - 200 MB of free hard disk space\nInternet speed requirement: At least 2mbps\nBrowser requirements: Assessment is supported by the below listed browsers / versions\nonly:\n✓ Google Chrome (version 60.0 and above)\n✓ Mozilla Firefox (version 60.0 and above)\n5/21/25, 2:41 PMGmail - [Important] Cognizant invites you to take the aptitude assessment\nhttps://mail.google.com/mail/u/0/?ik=51ecd87b23&view=pt&search=all&permthid=thread-f:1832717715792340933&simpl=",
  "h=all&permthid=thread-f:1832717715792340933&simpl=msg-f:1832717715792...2/3\n\nHow to take up assessment using the SAB tool?\nOnce the SAB tool is installed, please double click .exe file. It will open the tool.\nProvide the access token provided in the table below. Please note that the access token is case\nsensitive. Hence please provide the value correctly.\nUpon providing the access token, the system compatibility check will be done, after which the 'Start\nTest' button will be enabled.\nHit \"Start ",
  "e 'Start\nTest' button will be enabled.\nHit \"Start Test\" link only at the specified test commencement time as it will be enabled only then.\nIn the following page, provide the 'Superset ID', 'Password' & 'Passkey'. The values for these are ''\nCognizant candidate ID', 'Password' & the 'Assessment passkey' respectively, as seen in the table\nbelow.\nAfter these inputs are provided, the assessment will start successfully.\nPlease refer to the Aon guide, FAQ (page number 18).\nAssessment login credentials",
  "FAQ (page number 18).\nAssessment login credentials\nStart date & time\n2025 May, 22, 02:00 PM\nStudents can login until 30 min after the start time\ncommences\nDuration of the test80 minutes\nAccess token / Assessment URLassess-cognizant\nSuperset ID6355856\nPasswordbce17f5\nAssessment passkey1431939\nResources for General Troubleshooting:\nFor Technical support on the assessment day: Please write an email to: aasindiatechsupport-\ncognizant@aon.com with the below details along with the issue being faced:\nE",
  " below details along with the issue being faced:\nEmail id\nCollege Name\nAssessment date\nAttached screenshot of the error occurred\nBest wishes,\nHuman Resources - GenC\nNote : If selected, candidate will join as a fresher as no prior work experience will be considered.\nDisclaimer:\nCognizant does not entertain payments of any kind from candidates or vendors for employment. Requests for such payments should be\npromptly reported to GenCHRComplianceIND@cognizant.com\nIf you encounter anyone who claims to",
  "ognizant.com\nIf you encounter anyone who claims to offer jobs at Cognizant in return for any benefit (monetary or non-monetary), please do not\nentertain them. Please be informed that Cognizant shall not be held responsible for any such instances or payments you make.\nWe recommend that you do not respond to spam emails/ messages you do not trust; never disclose your personal or financial details to\nanyone you do not know. If any such mails purporting to come from Cognizant are received, we advise",
  "ing to come from Cognizant are received, we advise you to contact us at\nGenCHRComplianceIND@cognizant.com\nCognizant takes its hiring practices seriously and appreciates you keeping the Company informed of any individuals posing as Cognizant\nemployees who make false job offers using Cognizant's name. We remind you that while recruiting employees, Cognizant will only\ncommunicate with you through authentic Cognizant email addresses and Cognizant will never extend any job offers to anyone based on\na",
  "l never extend any job offers to anyone based on\nan online application without first conducting an in-person, video, or telephone interview through verified encrypted channels\nTo ascertain that you are receiving a genuine call from Cognizant, please ensure to collect the recruiter's details (full name; official email\nid, employee ID & mobile number) during the call.\n5/21/25, 2:41 PMGmail - [Important] Cognizant invites you to take the aptitude assessment\nhttps://mail.google.com/mail/u/0/?ik=51ec",
  "sessment\nhttps://mail.google.com/mail/u/0/?ik=51ecd87b23&view=pt&search=all&permthid=thread-f:1832717715792340933&simpl=msg-f:1832717715792...3/3"
]